<?php
/**
* 
*/
class ConvertData extends CApplicationComponent
{
    
    public function convert($str)
    {
        $tr = [
            "А"=>"a", "Б"=>"b", "В"=>"v", "Г"=>"g", "Д"=>"d", "Е"=>"e", "Ё"=>"e",
            "Ж"=>"j", "З"=>"z", "И"=>"i", "Й"=>"y", "К"=>"k", "Л"=>"l", "М"=>"m",
            "Н"=>"n", "О"=>"o", "П"=>"p", "Р"=>"r", "С"=>"s", "Т"=>"t", "У"=>"u",
            "Ф"=>"f", "Х"=>"h", "Ц"=>"ts", "Ч"=>"ch", "Ш"=>"sh", "Щ"=>"sch", "Ъ"=>"",
            "Ы"=>"i", "Ь"=>"j", "Э"=>"e", "Ю"=>"yu", "Я"=>"ya", "а"=>"a", "б"=>"b",
            "в"=>"v", "г"=>"g", "д"=>"d", "е"=>"e", "ё"=>"e", "ж"=>"j", "з"=>"z",
            "и"=>"i", "й"=>"y", "к"=>"k", "л"=>"l", "м"=>"m", "н"=>"n", "о"=>"o",
            "п"=>"p", "р"=>"r", "с"=>"s", "т"=>"t", "у"=>"u", "ф"=>"f", "х"=>"h",
            "ц"=>"ts", "ч"=>"ch", "ш"=>"sh", "щ"=>"sch", "ъ"=>"y", "ы"=>"i", "ь"=>"j",
            "э"=>"e", "ю"=>"yu", "я"=>"ya", " "=> "-", "."=> "", "/"=> "-", ","=>"-",
            "-"=>"-", "("=>"", ")"=>"", "["=>"", "]"=>"", "="=>"-", "+"=>"-",
            "*"=>"", "?"=>"", "\""=>"", "'"=>"", "&"=>"", "%"=>"", "#"=>"", "@"=>"",
            "!"=>"", ";"=>"", "№"=>"", "^"=>"", ":"=>"", "~"=>"", "\\"=>""
        ];
        return strtr($str,$tr);
    }

    public function convertToType($val, $attr, $rowArray)
    {
        $elem = explode(':', trim($val,'{}'));
        $result = $rowArray[current($elem)];

        if($attr=='slug' or $attr=='alias') {
            $result = $this->convert($result);
        }

        if (count($elem) <= 1)
            return $result; // без преобразования типа

        else{
            // нужно преобразовать
            settype($result, $elem[1]);
            return $result;
        }
    }
}
?>